app/controllers/application_controller.rb

SELECT * FROM `posts` LIMIT 1
---
  def load_archive_dates
    @months = []
    Post.all.group_by { |p| p.strftime("%B %Y")}.each do |month, posts|